/*=====================================================================+
表名称：  dws_th_ffm_metricsreport_day
功能描述：泰国运维监控报表

需求来源：
编写人员: 王昱棋
设计日期：2024/11/11
        修改日期:
        修改人员:
        修改原因:
-----------------------------------------------------------------------
---存在问题：
-----------------------------------------------------------------------
+=====================================================================*/

-- drop table if exists dwm.dws_th_ffm_metricsreport_day;
-- create table dwm.dws_th_ffm_metricsreport_day as
# delete from dwm.dws_th_ffm_metricsreport_day where 日期 >= date_sub(date(now() + interval -1 hour),interval 90 day); -- 先删除数据
# insert into dwm.dws_th_ffm_metricsreport_day -- 再插入数据



    -- 各部分权重得分合计
select
    日期
    ,仓库
    ,case 仓库
                when 'BST' then 1
                when 'AGV' then 2
                when 'LAS' then 3
                when 'BPL3' then 4
                when 'BPL-Return' then 5
                end as asc1
    ,'入库' 入库
    ,采购订单入库及时率
    ,采购订单上架及时率
    ,销退订单上架及时率
    ,商品审核及时率
    ,收货及时率_采购得分
    ,上架及时率_采购得分
    ,上架及时率_销退得分
    ,商品审核及时率_得分
    ,cast(收货及时率_采购得分*入库收货权重*入库权重 as DECIMAL(25,2)) 收货及时率_采购权重得分
    ,上架及时率_采购得分*入库采购上架权重*入库权重 上架及时率_采购权重得分
    ,上架及时率_销退得分*入库销退上架权重*入库权重 上架及时率_销退权重得分
    ,收货及时率_采购得分*入库收货权重 + 上架及时率_采购得分*入库采购上架权重 + 上架及时率_销退得分*入库销退上架权重 入库得分
    ,(收货及时率_采购得分*入库收货权重 + 上架及时率_采购得分*入库采购上架权重 + 上架及时率_销退得分*入库销退上架权重)*入库权重 入库权重得分
    ,'出库' 出库
    ,B2C交接及时率
    ,B2C发货及时率
    ,B2B打包及时率
    ,B2C交接及时率_得分
    ,B2C发货及时率_得分
    ,B2B打包及时率_得分
    ,B2C交接及时率_得分* 出库2C打包权重 *出库权重 B2C交接及时率_权重得分
    ,B2C发货及时率_得分* 出库发货权重 *出库权重 B2C发货及时率_权重得分
    ,B2B打包及时率_得分* 出库2B打包权重 *出库权重 B2B打包及时率_权重得分
    ,B2C交接及时率_得分 * 出库2C打包权重 + B2C发货及时率_得分* 出库发货权重 + B2B打包及时率_得分*出库2B打包权重 出库得分
    ,(B2C交接及时率_得分 * 出库2C打包权重 + B2C发货及时率_得分* 出库发货权重 + B2B打包及时率_得分*出库2B打包权重)*出库权重 出库权重得分
    ,'在库' 在库
    ,库存准确率
    ,库存准确率_得分 库存得分
    ,库存准确率_得分 * 在库权重  库存权重得分
    ,'异常' 异常
    ,拦截归位及时率（24H）
    ,异常单及时率（24H）
    ,拦截归位及时率（24H）_得分
    ,异常单及时率（24H）_得分
    ,拦截归位及时率（24H）_得分* 异常拦截权重 * 异常权重 拦截归位及时率（24H）_权重得分
    ,异常单及时率（24H）_得分* 异常异常权重 * 异常权重 异常单及时率（24H）_权重得分
    ,拦截归位及时率（24H）_得分 * 异常拦截权重 + 异常单及时率（24H）_得分 * 异常异常权重 异常得分
    ,(拦截归位及时率（24H）_得分 * 异常拦截权重 + 异常单及时率（24H）_得分 * 异常异常权重) * 异常权重 异常权重得分
    ,'投诉率' 投诉率
    ,客诉成立率
    ,处理及时率
    ,客诉成立率_得分
    ,处理及时率_得分
    ,客诉成立率_得分*投诉成立权重*投诉权重 客诉成立率权重_得分
    ,处理及时率_得分*投诉处理权重*投诉权重 处理及时率权重_得分
    ,(客诉成立率_得分*投诉成立权重 + 处理及时率_得分*投诉处理权重)*投诉权重 投诉权重得分
    ,'效率' 效率
    ,if(在职人效件天人 is null, 1, 在职人效件天人) 在职人效件天人
    ,if(在职人效件天人 is null, 100, 在职人效件天人_得分) 在职人效件天人_得分
    ,if(在职人效件天人 is null, 100, 在职人效件天人_得分)*效率人效权重*效率权重  效率权重得分
    ,'成本' 成本
    ,if(件均成本 is null, 1, 件均成本) 件均成本
    ,件均人力目标
    ,if(件均成本 is null, 100, 件均成本_得分)  成本得分
    ,if(件均成本 is null, 100, 件均成本_得分)*成本单均权重*成本权重  成本权重得分
    ,'总分' 总分
    ,(收货及时率_采购得分*入库收货权重 + 上架及时率_采购得分*入库采购上架权重 + 上架及时率_销退得分*入库销退上架权重)*入库权重
        + (B2C交接及时率_得分 * 出库2C打包权重 + B2C发货及时率_得分* 出库发货权重 + B2B打包及时率_得分*出库2B打包权重)*出库权重
        + 库存准确率_得分*在库权重
        + (拦截归位及时率（24H）_得分 * 异常拦截权重 + 异常单及时率（24H）_得分 * 异常异常权重)*异常权重
        + (客诉成立率_得分*投诉成立权重 + 处理及时率_得分*投诉处理权重)*投诉权重
        + if(在职人效件天人 is null, 100, 在职人效件天人_得分)*效率人效权重*效率权重
        + if(件均成本 is null, 100, 件均成本_得分)*成本单均权重*成本权重 仓库得分
from
(   -- 计算得分项
       -- 计算得分项
    select
        日期
        ,仓库
        ,'入库'
        ,采购订单入库及时率
        ,收货及时率_采购扣分
        ,100 - 收货及时率_采购扣分 收货及时率_采购得分
        ,采购订单上架及时率
        ,上架及时率_采购扣分
        ,100 - 上架及时率_采购扣分 上架及时率_采购得分
        ,销退订单上架及时率
        ,上架及时率_销退扣分
        ,100 - 上架及时率_销退扣分 上架及时率_销退得分
        ,商品审核及时率
        ,商品审核及时率_扣分
        ,100 - 商品审核及时率_扣分 商品审核及时率_得分
        ,'出库'
        ,B2C交接及时率
        ,B2C交接及时率_扣分
        ,100 - B2C交接及时率_扣分 B2C交接及时率_得分
        ,B2C发货及时率
        ,B2C发货及时率_扣分
        ,100 - B2C发货及时率_扣分 B2C发货及时率_得分
        ,B2B打包及时率
        ,B2B打包及时率_扣分
        ,100 - B2B打包及时率_扣分 B2B打包及时率_得分
        ,'在库'
        ,库存准确率
        ,库存准确率_扣分
        ,100 - 库存准确率_扣分 库存准确率_得分
        ,'异常'
        ,拦截归位及时率（24H）
        ,拦截归位及时率（24H）_扣分
        ,100 - 拦截归位及时率（24H）_扣分 拦截归位及时率（24H）_得分
        ,异常单及时率（24H）
        ,异常单及时率（24H）_扣分
        ,100 - 异常单及时率（24H）_扣分 异常单及时率（24H）_得分
        ,'投诉率'
        ,客诉成立率
        ,客诉成立率_扣分
        ,100 - 客诉成立率_扣分 客诉成立率_得分
        ,处理及时率
        ,处理及时率_扣分
        ,100 - 处理及时率_扣分 处理及时率_得分
        ,'效率' --
        ,在职人效件天人
        ,在职人效件天人_扣分
        ,100 - 在职人效件天人_扣分 在职人效件天人_得分
        ,'成本'
        ,件均成本
        ,件均人力目标
        ,件均成本_扣分
        ,100 - 件均成本_扣分 件均成本_得分
        ,入库权重
        ,出库权重
        ,在库权重
        ,异常权重
        ,投诉权重
        ,效率权重
        ,成本权重
        ,入库收货权重
        ,入库采购上架权重
        ,入库销退上架权重
        ,出库2C打包权重
        ,出库发货权重
        ,出库2B打包权重
        ,在库库位权重
        ,在库库存权重
        ,在库盘点权重
        ,异常拦截权重
        ,异常异常权重
        ,投诉成立权重
        ,投诉处理权重
        ,效率人效权重
        ,成本单均权重
    from
    ( -- 计算扣分项
        select
            od.日期
            ,od.仓库
            ,'入库'
            ,od.采购订单入库及时率
            ,case
                when od.采购订单入库及时率 =  (入库收货目标-0.01*0) then 0
                when od.采购订单入库及时率 >= (入库收货目标-0.01*1) then 10*1
                when od.采购订单入库及时率 >= (入库收货目标-0.01*2) then 10*2
                when od.采购订单入库及时率 >= (入库收货目标-0.01*3) then 10*3
                when od.采购订单入库及时率 >= (入库收货目标-0.01*4) then 10*4
                when od.采购订单入库及时率 >= (入库收货目标-0.01*5) then 10*5
                when od.采购订单入库及时率 <  (入库收货目标-0.01*5) then 100
                end as 收货及时率_采购扣分
            ,od.采购订单上架及时率
            ,case
                when od.采购订单上架及时率 =  (入库采购上架目标-0.01*0) then 0
                when od.采购订单上架及时率 >= (入库采购上架目标-0.01*1) then 10*1
                when od.采购订单上架及时率 >= (入库采购上架目标-0.01*2) then 10*2
                when od.采购订单上架及时率 >= (入库采购上架目标-0.01*3) then 10*3
                when od.采购订单上架及时率 >= (入库采购上架目标-0.01*4) then 10*4
                when od.采购订单上架及时率 >= (入库采购上架目标-0.01*5) then 10*5
                when od.采购订单上架及时率 <  (入库采购上架目标-0.01*5) then 100
                end as 上架及时率_采购扣分
            ,od.销退订单上架及时率
            ,case
                when od.销退订单上架及时率 =  (入库销退上架目标 -0.01*0) then 0
                when od.销退订单上架及时率 >= (入库销退上架目标 -0.01*1) then 10*1
                when od.销退订单上架及时率 >= (入库销退上架目标 -0.01*2) then 10*2
                when od.销退订单上架及时率 >= (入库销退上架目标 -0.01*3) then 10*3
                when od.销退订单上架及时率 >= (入库销退上架目标 -0.01*4) then 10*4
                when od.销退订单上架及时率 >= (入库销退上架目标 -0.01*5) then 10*5
                when od.销退订单上架及时率 <  (入库销退上架目标 -0.01*5) then 100
                end as 上架及时率_销退扣分
            ,od.商品审核及时率
            ,case -- 目前逻辑用不到了
                when od.商品审核及时率 =  (1-0.01*0) then 0
                when od.商品审核及时率 >= (1-0.01*1) then 5*1
                when od.商品审核及时率 >= (1-0.01*2) then 5*2
                when od.商品审核及时率 >= (1-0.01*3) then 5*3
                when od.商品审核及时率 >= (1-0.01*4) then 5*4
                when od.商品审核及时率 >= (1-0.01*5) then 5*5
                when od.商品审核及时率 <  (1-0.01*5) then 100
                end as 商品审核及时率_扣分
            ,'出库'
            ,od.B2C交接及时率
            ,case
                when od.B2C交接及时率 >= 出库2C交接目标 - 0.005*0  then 10*0
                when od.B2C交接及时率 >= 出库2C交接目标 - 0.005*1  then 10*1
                when od.B2C交接及时率 >= 出库2C交接目标 - 0.005*2  then 10*2
                when od.B2C交接及时率 >= 出库2C交接目标 - 0.005*3  then 10*3
                when od.B2C交接及时率 >= 出库2C交接目标 - 0.005*4  then 10*4
                when od.B2C交接及时率 >= 出库2C交接目标 - 0.005*5  then 10*5
                when od.B2C交接及时率 >= 出库2C交接目标 - 0.005*6  then 10*6
                when od.B2C交接及时率 >= 出库2C交接目标 - 0.005*7  then 10*7
                when od.B2C交接及时率 >= 出库2C交接目标 - 0.005*8  then 10*8
                when od.B2C交接及时率 <  出库2C交接目标 - 0.005*8  then 100
                end as B2C交接及时率_扣分
            ,od.B2C发货及时率
            ,case
                when od.B2C发货及时率 >= 出库发货目标 - 0.005*0 then 10*0
                when od.B2C发货及时率 >= 出库发货目标 - 0.005*1 then 10*1
                when od.B2C发货及时率 >= 出库发货目标 - 0.005*2 then 10*2
                when od.B2C发货及时率 >= 出库发货目标 - 0.005*3 then 10*3
                when od.B2C发货及时率 >= 出库发货目标 - 0.005*4 then 10*4
                when od.B2C发货及时率 >= 出库发货目标 - 0.005*5 then 10*5
                when od.B2C发货及时率 >= 出库发货目标 - 0.005*6 then 10*6
                when od.B2C发货及时率 >= 出库发货目标 - 0.005*7 then 10*7
                when od.B2C发货及时率 >= 出库发货目标 - 0.005*8 then 10*8
                when od.B2C发货及时率 <  出库发货目标 - 0.005*8 then 100
                end as B2C发货及时率_扣分
            ,od.B2B打包及时率
            ,case
                when od.B2B打包及时率 >= 出库2B打包目标 - 0.005*0 then 10*0
                when od.B2B打包及时率 >= 出库2B打包目标 - 0.005*1 then 10*1
                when od.B2B打包及时率 >= 出库2B打包目标 - 0.005*2 then 10*2
                when od.B2B打包及时率 >= 出库2B打包目标 - 0.005*3 then 10*3
                when od.B2B打包及时率 >= 出库2B打包目标 - 0.005*4 then 10*4
                when od.B2B打包及时率 >= 出库2B打包目标 - 0.005*5 then 10*5
                when od.B2B打包及时率 >= 出库2B打包目标 - 0.005*6 then 10*6
                when od.B2B打包及时率 >= 出库2B打包目标 - 0.005*7 then 10*7
                when od.B2B打包及时率 >= 出库2B打包目标 - 0.005*8 then 10*8
                when od.B2B打包及时率 <  出库2B打包目标 - 0.005*8 then 100
                end as B2B打包及时率_扣分
            ,'在库' -- 搁置
            ,od.库存准确率
            ,case
                when od.库存准确率 >= 在库库存目标 then 0
                when od.库存准确率 >= 在库库存目标 - 0.0002 then 5
                when od.库存准确率 >= 在库库存目标 - 0.0003 then 10
                when od.库存准确率 >= 在库库存目标 - 0.0004 then 30
                when od.库存准确率 >= 在库库存目标 - 0.0005 then 50
                when od.库存准确率 <  在库库存目标 - 0.0005 then 100
                end as 库存准确率_扣分
            ,'异常'
            ,od.拦截归位及时率（24H）
            ,case
                when od.拦截归位及时率（24H） >= 异常拦截目标 - 0.05*0 then 0
                when od.拦截归位及时率（24H） >= 异常拦截目标 - 0.05*1 then 10*1
                when od.拦截归位及时率（24H） >= 异常拦截目标 - 0.05*2 then 10*2
                when od.拦截归位及时率（24H） >= 异常拦截目标 - 0.05*3 then 10*3
                when od.拦截归位及时率（24H） >= 异常拦截目标 - 0.05*4 then 10*5
                when od.拦截归位及时率（24H） <  异常拦截目标 - 0.05*4 then 100
                end as 拦截归位及时率（24H）_扣分
            ,od.异常单及时率（24H）
            ,case
                when od.异常单及时率（24H） >= 异常异常目标 * (1-0.05*0) then 0
                when od.异常单及时率（24H） >= 异常异常目标 * (1-0.05*1) then 10*1
                when od.异常单及时率（24H） >= 异常异常目标 * (1-0.05*2) then 10*2
                when od.异常单及时率（24H） >= 异常异常目标 * (1-0.05*3) then 10*3
                when od.异常单及时率（24H） >= 异常异常目标 * (1-0.05*4) then 10*5
                when od.异常单及时率（24H） <  异常异常目标 * (1-0.05*4) then 100
                end as 异常单及时率（24H）_扣分
            ,'投诉率'
            ,od.客诉成立率
            ,case
                when od.客诉成立率 <= 投诉成立目标 then 0
                when od.客诉成立率 <= 投诉成立目标 + 0.0001*1  then 10
                when od.客诉成立率 <= 投诉成立目标 + 0.0001*2  then 10*2
                when od.客诉成立率 <= 投诉成立目标 + 0.0001*3  then 10*3
                when od.客诉成立率 <= 投诉成立目标 + 0.0001*4  then 10*4
                when od.客诉成立率 <= 投诉成立目标 + 0.0001*5  then 10*5
                when od.客诉成立率 <= 投诉成立目标 + 0.0001*6  then 10*6
                when od.客诉成立率 <= 投诉成立目标 + 0.0001*7  then 10*7
                when od.客诉成立率 <= 投诉成立目标 + 0.0001*8  then 10*8
                when od.客诉成立率 <= 投诉成立目标 + 0.0001*9  then 10*9
                when od.客诉成立率 <= 投诉成立目标 + 0.0001*10 then 10*10
                when od.客诉成立率 >  投诉成立目标 + 0.0001*10  then 100
                end as 客诉成立率_扣分
            ,od.处理及时率
            ,case
                when od.处理及时率 >= 投诉处理目标 then 0
                when od.处理及时率 >= 投诉处理目标 - 0.01*1 then 10*1
                when od.处理及时率 >= 投诉处理目标 - 0.01*2 then 10*2
                when od.处理及时率 >= 投诉处理目标 - 0.01*3 then 10*3
                when od.处理及时率 >= 投诉处理目标 - 0.01*4 then 10*4
                when od.处理及时率 >= 投诉处理目标 - 0.01*5 then 10*5
                when od.处理及时率 <  投诉处理目标 - 0.01*5 then 100
                end as 处理及时率_扣分
            ,'效率' --
            ,od.在职人效件天人
            ,case
                when od.在职人效件天人/ft.在职人效件天人目标 >= 1 then 0
                when od.在职人效件天人/ft.在职人效件天人目标 >= 1-0.05 then 10
                when od.在职人效件天人/ft.在职人效件天人目标 >= 1-0.05*2 then 10*2
                when od.在职人效件天人/ft.在职人效件天人目标 >= 1-0.05*3 then 10*3
                when od.在职人效件天人/ft.在职人效件天人目标 >= 1-0.05*4 then 10*5
                when od.在职人效件天人/ft.在职人效件天人目标 <  1-0.05*4 then 100
                end as 在职人效件天人_扣分
            ,'成本'
            ,od.件均成本
            ,ft.件均人力目标
            ,case when od.件均成本 - ft.件均人力目标 <= 0       then 10*0
                  when od.件均成本 - ft.件均人力目标 <= 0.2*1   then 10*1
                  when od.件均成本 - ft.件均人力目标 <= 0.2*2   then 10*2
                  when od.件均成本 - ft.件均人力目标 <= 0.2*3   then 10*3
                  when od.件均成本 - ft.件均人力目标 <= 0.2*4   then 10*5
                  when od.件均成本 - ft.件均人力目标 >  0.2*4   then 100
                  end as 件均成本_扣分
            ,入库权重
            ,出库权重
            ,在库权重
            ,异常权重
            ,投诉权重
            ,效率权重
            ,成本权重
            ,入库收货权重
            ,入库采购上架权重
            ,入库销退上架权重
            ,出库2C打包权重
            ,出库发货权重
            ,出库2B打包权重
            ,在库库位权重
            ,在库库存权重
            ,在库盘点权重
            ,异常拦截权重
            ,异常异常权重
            ,投诉成立权重
            ,投诉处理权重
            ,效率人效权重
            ,成本单均权重
        from dwm.dws_th_ffm_operateMonitor_day od
        left join dwm.dwm_tmp_th_ffmtarget ft on od.仓库 = ft.仓库
        where 日期 >= date_sub(date(now() + interval -1 hour),interval 90 day)
    ) t0
) t1